# Yosys Synthesis Script — multiple_modules (Flattened)
# Target: SkyWater SKY130 Standard Cell Library

read_liberty -lib ../my_lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
read_verilog multiple_modules.v
synth -top multiple_modules
flatten                            # Dissolve all hierarchy
abc -liberty ../my_lib/lib/sky130_fd_sc_hd__tt_025C_1v80.lib
show
write_verilog -noattr multiple_modules_flat.v
